let data = {
  baseInfo: {
    mPoint: 68, //监测点数量
    wPoint: 8, //预警监测点
    bPoint: 32, //北斗
    sPoint: 25, //倾斜
    wPoint: 25, //风力
    tPoint: 11 //温度
  },
  //底部地图
  mainChart: {
    zoom: 12, //地图大小级别
    center: [121.628572, 29.866033], //中心坐标
    data: [{
        name: '月湖公园',
        id: 89563, //编号id
        num: 10, //数量
        isError: false //是否有问题
      },
      {
        name: '宁波东站',
        id: 3647,
        num: 5,
        isError: true
      },
      {
        name: '宁波体育中心',
        id: 111,
        num: 1,
        isError: false
      },
      {
        name: '科技公园',
        id: 222,
        num: 4,
        isError: true
      },
      {
        name: '四安文化乐园',
        id: 7894561123,
        num: 20,
        isError: true
      },
      {
        name: '体育馆',
        id: 1,
        num: 30,
        isError: true
      }
    ],
    geoCoordMap: {
      月湖公园: [121.549234, 29.874051],
      宁波东站: [121.591921, 29.854131],
      宁波体育中心: [121.588328, 29.877307],
      科技公园: [121.637771, 29.880564],
      四安文化乐园: [121.681177, 29.848743],
      体育馆: [121.612762, 29.918887]
    },
  },
  //北斗
  bChart: [{
      xDate: [
        '2018-2-3 15:15:13', //日期
        '2018-2-4 16:40:23',
        '2018-2-5 17:10:23',
        '2018-2-6 18:40:33',
        '2018-2-7 19:21:08',
        '2018-2-8 12:21:22',
        '2018-2-9 05:10:53',
      ],
      xData: {
        d: [-1, 1, 5, 3, 2, 4, 1], //东
        b: [1, 2, -3, 4, 2, 1, 2], //北
        t: [2, -1, 1, 3, 2, 5, 4] //天
      }
    },
    {
      xDate: [
        '2018-2-3 15:15:13', //日期
        '2018-2-4 16:40:23',
        '2018-2-5 17:10:23',
        '2018-2-6 18:40:33',
        '2018-2-7 19:21:08',
        '2018-2-8 12:21:22',
        '2018-2-9 05:10:53',
      ],
      xData: {
        d: [-4, 1, -5, -3, 2, 4, 1],
        b: [-1, -2, 3, 4, -2, -1, -2],
        t: [-2, -1, 5, 2, 2, -5, 4]
      }
    }
  ],
  //倾斜
  sChart: [{
      xDate: [
        '2018-2-3 15:15:13', //日期
        '2018-2-4 16:40:23',
        '2018-2-5 17:10:23',
        '2018-2-6 18:40:33',
        '2018-2-7 19:21:08',
        '2018-2-8 12:21:22',
        '2018-2-9 05:10:53',
      ],
      xData: {
        x: [-1, 1, 5, 3, 2, 4, 1], //x
        y: [1, 2, -3, 4, 2, 1, 2], //y
      }
    },
    {
      xDate: [
        '2018-2-3 15:15:13', //日期
        '2018-2-4 16:40:23',
        '2018-2-5 17:10:23',
        '2018-2-6 18:40:33',
        '2018-2-7 19:21:08',
        '2018-2-8 12:21:22',
        '2018-2-9 05:10:53',
      ],
      xData: {
        x: [-4, 1, -5, -3, 2, 4, 1],
        y: [-1, -2, 3, 4, -2, -1, -2],
      }
    }
  ],
  //风力
  wChart: {
    xDate: [
      '2018-2-3 15:15:13', //日期
      '2018-2-4 16:40:23',
      '2018-2-5 17:10:23',
      '2018-2-6 18:40:33',
      '2018-2-7 19:21:08',
      '2018-2-8 12:21:22',
      '2018-2-9 05:10:53',
    ],
    xData: {
      d: [-1, 1, 5, 3, 2, 4, 1],
    }
  },
  //温度
  tChart: {
    xDate: [
      '2018-2-3 15:15:13', //日期
      '2018-2-4 16:40:23',
      '2018-2-5 17:10:23',
      '2018-2-6 18:40:33',
      '2018-2-7 19:21:08',
      '2018-2-8 12:21:22',
      '2018-2-9 05:10:53',
    ],
    xData: {
      d: [-1, 1, 5, 3, 2, 4, 1],
    }
  },
  //湿度
  hChart: {
    xDate: [
      '2018-2-3 15:15:13', //日期
      '2018-2-4 16:40:23',
      '2018-2-5 17:10:23',
      '2018-2-6 18:40:33',
      '2018-2-7 19:21:08',
      '2018-2-8 12:21:22',
      '2018-2-9 05:10:53',
    ],
    xData: {
      d: [-1, 1, 5, 3, 2, 4, 1],
    }
  },
  treeData: [{
      id: 1220,
      parentId: 0,
      name: "电力塔检测",
      children: [{
        id: 1221,
        parentId: 1220,
        name: "220kV",
        children: [{
          id: 2222,
          parentId: 1221,
          name: "浙江线",
          children: [{
              id: 111, //此id为监测塔id，父级id只要不重复就好，并且子级对应父级
              parentId: 2222,
              name: "111号塔",
              isLast: true, //只有是最后一级时才存在true
            },
            {
              id: 222,
              parentId: 2222,
              name: "222号塔",
              isLast: true //只有是最后一级时才存在true
            }, {
              id: 1,
              parentId: 2222,
              name: "1号塔",
              isLast: true //只有是最后一级时才存在true
            }
          ]
        }, {
          id: 1222,
          parentId: 1221,
          name: "云南线",
          children: [{
              id: 3226,
              parentId: 1222,
              name: "111号塔",
              isLast: true //只有是最后一级时才存在true
            },
            {
              id: 3227,
              parentId: 1222,
              name: "222号塔",
              isLast: true //只有是最后一级时才存在true
            }, {
              id: 3228,
              parentId: 1222,
              name: "1号塔",
              isLast: true //只有是最后一级时才存在true
            }
          ]
        }]
      }, {
        id: 221,
        parentId: 220,
        name: "1000kV",
        children: [{
          id: 5222,
          parentId: 221,
          name: "江苏线",
          children: [{
              id: 55223,
              parentId: 5222,
              name: "55223",
              isLast: true //只有是最后一级时才存在true
            },
            {
              id: 55224,
              parentId: 5222,
              name: "55224",
              isLast: true //只有是最后一级时才存在true
            }, {
              id: 55225,
              parentId: 5222,
              name: "55225",
              isLast: true //只有是最后一级时才存在true
            }
          ]
        }, {
          id: 6222,
          parentId: 221,
          name: "云南线",
          children: [{
              id: 66223,
              parentId: 6222,
              name: "66223",
              isLast: true //只有是最后一级时才存在true
            },
            {
              id: 66224,
              parentId: 6222,
              name: "66224",
              isLast: true //只有是最后一级时才存在true
            }, {
              id: 66225,
              parentId: 6222,
              name: "66225",
              isLast: true //只有是最后一级时才存在true
            }
          ]
        }]
      }],
    },
    {
      id: 22221,
      parentId: 0,
      name: "高压电站",
      children: [],
    },
  ]
}

export default data
